Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationOrigins
The origin of the exaggeration.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationOrigins.NearDimensionLine
Start the exaggeration close to the dimension line.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationOrigins.NearMeasuredObject
Start the exaggeration as soon as possible as seen from the measured part.